# :heavy_check_mark:Terragrunt Plan
```hcl
Group 1
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample/hcl/network
Group 2
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample/hcl/ec2

Plan: 0 to add, 6 to change, 0 to destroy.
Plan: 4 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Details</summary>


```hcl
Group 1
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample/hcl/network
Group 2
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample/hcl/ec2

--------
COMMAND: terragrunt run-all plan --terragrunt-non-interactive -no-color terragrunt-working-dir=hcl   --terragrunt-source-update 
WORKSPACE: tc3-cicd
AWS_PROFILE: default
--------
[INFO] Getting version from tgenv-version-name
[INFO] TGENV_VERSION is 0.40.2
aws_vpc.this[0]: Refreshing state... [id=vpc-052058af405bc37ec]
aws_subnet.public[1]: Refreshing state... [id=subnet-0dbf08dd1a4d25c66]
aws_subnet.public[0]: Refreshing state... [id=subnet-0b11bc131a71ba424]
aws_route_table.public[0]: Refreshing state... [id=rtb-02dd14b5417006bd1]
aws_subnet.public[2]: Refreshing state... [id=subnet-0a8c47ca2ae69358a]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d0d825d8589fc614]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02dd14b5417006bd11080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-019268749a1f382f8]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0e7fde4ffd19b6eed]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0290c9b8d7669d3af]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0d0d825d8589fc614"
      ~ tags     = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-02dd14b5417006bd1"
      ~ tags             = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0b11bc131a71ba424"
      ~ tags                                           = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all                                       = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0dbf08dd1a4d25c66"
      ~ tags                                           = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all                                       = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0a8c47ca2ae69358a"
      ~ tags                                           = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all                                       = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-052058af405bc37ec"
      ~ tags                             = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
      ~ tags_all                         = {
          + "Environment" = "47b"
          + "Terraform"   = "true"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
tls_private_key.default: Refreshing state... [id=7217e49b42b22b0498cb87d29476ae9f98fc4b00]
local_file.public_key_openssh: Refreshing state... [id=91a73712c432b53486f2fb62fbd63024e08a9af8]
local_file.private_key_pem: Refreshing state... [id=6f1b493de5ae4b4be4742cd761bbba6cea491d43]
aws_key_pair.auth: Refreshing state... [id=tc3-cicd-bastion]
aws_security_group.bastion: Refreshing state... [id=sg-0256c2642990a9307]
aws_instance.bastion: Refreshing state... [id=i-06446378f988a868c]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_security_group.bastion has been deleted
  - resource "aws_security_group" "bastion" {
      - id                     = "sg-0256c2642990a9307" -> null
        name                   = "tc3-cicd-bastion-sg"
        tags                   = {
            "Name" = "tc3-cicd-bastion-sg"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-0701e21c502689c31"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "tc3-cicd-bastion"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0b11bc131a71ba424"
      + tags                                 = {
          + "Name" = "tc3-cicd-bastion"
        }
      + tags_all                             = {
          + "Name" = "tc3-cicd-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "bastion-sg"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "egress all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "3.112.23.0/29",
                ]
              + description      = "tokyo-region-instance-connect"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "tc3-cicd-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tc3-cicd-bastion-sg"
        }
      + tags_all               = {
          + "Name" = "tc3-cicd-bastion-sg"
        }
      + vpc_id                 = "vpc-052058af405bc37ec"
    }

  # local_file.private_key_pem will be created
  + resource "local_file" "private_key_pem" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./.key_pair/tc3-cicd-bastion.id_rsa"
      + id                   = (known after apply)
    }

  # local_file.public_key_openssh will be created
  + resource "local_file" "public_key_openssh" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./.key_pair/tc3-cicd-bastion.id_rsa.pub"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
<!-- plan -->